{
    "2025_cremaschi_steellm": [
        {
            "ref": "2019_nguyen_mtab",
            "title": "022. Semantic Web Challenge on Tabular Data to Knowledge Graph Matching , 3320, 2"
        },
        {
            "ref": "",
            "title": "022. [2]N. Abdelmageed, J. Chen, V. Cutrona, V. Efthymiou, O. Hassanzadeh, M. Hulsebos, E. Jiménez-Ruiz, J. Sequeda, and K. Srinivas. Results of semtab 2"
        },
        {
            "ref": "2019_nguyen_mtab",
            "title": "022. Semantic Web Challenge on Tabular Data to Knowledge Graph Matching , 3320, 2"
        },
        {
            "ref": "",
            "title": "022. [3]N. Abdelmageed and S. Schindler. Jentab: Matching tabular data to knowledge graphs. In SemTab@ ISWC , pages 40–49, 2"
        },
        {
            "ref": "",
            "title": "020. [4]N. Abdelmageed and S. Schindler. Jentab meets semtab 2021’s new challenges. In SemTab@ ISWC , pages 42–53, 2"
        },
        {
            "ref": "",
            "title": "021. [5]G. Agrawal, T. Kumarage, Z. Alghamdi, and H. Liu. Can knowledge graphs reduce hallucinations in LLMs? : A survey. In K. Duh, H. Gomez, and S. Bethard, editors, Proceedingsofthe2024ConferenceoftheNorthAmericanChapteroftheAssociationforComputational Linguistics: Human Language Technologies (Volume 1: Long Papers) , pages 3947–3960, Mexico City, Mexico, June 2"
        },
        {
            "ref": "",
            "title": "024. Association for Computational Linguistics. [6]R. Avogadro and M. Cremaschi. Mantistable v: A novel and efficient approach to semantic table interpretation. In SemTab@ISWC , pages 79–91, 2"
        },
        {
            "ref": "",
            "title": "021. [7]R. Avogadro, M. Cremaschi, F. D’adda, F. De Paoli, M. Palmonari, et al. Lamapi: a comprehensive tool for string-based entity retrieval with type-base filters. In 17th ISWCworkshopon ontology matching (OM) , 2"
        },
        {
            "ref": "",
            "title": "022. [8]R. Avogadro, F. D’Adda, and M. Cremaschi. Feature/vector entity retrieval and disambiguation techniques to create a supervised and unsupervised semantic table interpretation approach. Knowledge-Based Systems , 304:112447, 2"
        },
        {
            "ref": "",
            "title": "024. [9]R. Avogadro, F. D’Adda, and M. Cremaschi. Feature/vector entity retrieval and disambiguation techniques to create a supervised and unsupervised semantic table interpretation approach. Knowledge-Based Systems , 304:112447, 2"
        },
        {
            "ref": "",
            "title": "024. [10]R. Azzi, G. Diallo, E. Jiménez-Ruiz, O. Hassanzadeh, V. Efthymiou, J. Chen, and K. Srinivas. Amalgam: making tabular dataset explicit with knowledge graph. In SemTab@ ISWC , pages 9–16, 2"
        },
        {
            "ref": "",
            "title": "020. [11]W. Baazouzi, M. Kachroudi, and S. Faiz. Kepler-asi at semtab 2"
        },
        {
            "ref": "",
            "title": "021. [12]F. Belotti, F. Dadda, M. Cremaschi, R. Avogadro, R. Pozzi, and M. Palmonari. Evaluating language models on entity disambiguation in tables.arXiv e-prints , pages arXiv–2408, 2"
        },
        {
            "ref": "",
            "title": "024. [13]C. S. Bhagavatula, T. Noraset, and D. Downey. Tabel: Entity linking in web tables. In TheSemanticWeb-ISWC2015 , pages 425–441, 2"
        },
        {
            "ref": "",
            "title": "015. [14]Y. Chabot, T. Labbé, J. Liu, and R. Troncy. Dagobah: An end-to-end context-free tabular data semantic annotation system. In SemTab@ ISWC, pages 41–48, 10 2"
        },
        {
            "ref": "",
            "title": "019. [15]J. Chen, E. Jiménez-Ruiz, I. Horrocks, and C. Sutton. Colnet: Embedding the semantics of web tables for column type prediction. In Proceedings of the AAAI Conference on Artificial Intelligence , volume 33, pages 29–36, 2"
        },
        {
            "ref": "",
            "title": "019. [16]S. Chen, A. Karaoglu, C. Negreanu, T. Ma, J.-G. Yao, J. Williams, A. Gordon, and C.-Y. Lin. Linkingpark: An integrated approach for semantic table interpretation. In SemTab@ ISWC , pages 65–74, 2"
        },
        {
            "ref": "",
            "title": "020. [17]S. Chen, A. Karaoglu, C. Negreanu, T. Ma, J.-G. Yao, J. Williams, F. Jiang, A. Gordon, and C.-Y. Lin. Linkingpark: An automatic semantic table interpretation system. Journal of Web Semantics , 74:100733, 2"
        },
        {
            "ref": "",
            "title": "022. [18]N. Chirkova and S. Troshin. Codebpe: Investigating subtokenization options for large language model pretraining on source code, 2"
        },
        {
            "ref": "",
            "title": "023. [19]M. Cremaschi, R. Avogadro, A. Barazzetti, D. Chieregato, and E. Jiménez-Ruiz. Mantistable se: an efficient approach for the semantic table interpretation. In SemTab@ISWC , pages 75–85, 2"
        },
        {
            "ref": "",
            "title": "020. [20]M. Cremaschi, R. Avogadro, and D. Chieregato. Mantistable: an automatic approach for the semantic table interpretation. SemTab@ ISWC, 2019:15–24, 2"
        },
        {
            "ref": "",
            "title": "019. ACM Trans. Intell. Syst. Technol. 28 • Cremaschi, et al. [21]M. Cremaschi, R. Avogadro, D. Chieregato, et al. s-elbat: A semantic interpretation approach for messy table-s. In SemTab@ISWC , pages 59–71, 2"
        },
        {
            "ref": "",
            "title": "022. [22]M. Cremaschi, F. De Paoli, A. Rula, and B. Spahiu. A fully automated approach to a complete semantic table interpretation. Future Generation Computer Systems , 112:478 – 500, 2"
        },
        {
            "ref": "",
            "title": "020. [23]M. Cremaschi, F. D’Adda, and S. Nocco. Mantistable ui: A web interface for comprehensive semantic table interpretation management. 2"
        },
        {
            "ref": "",
            "title": "024. [24]M. Cremaschi, A. Rula, A. Siano, and F. De Paoli. Mantistable: a tool for creating semantic annotations on tabular data. In TheSemantic Web: ESWC 2019 Satellite Events: ESWC 2019 Satellite Events,Portorož, Slovenia, June 2–6, 2019, Revised Selected Papers 16 , pages 18 –"
        },
        {
            "ref": "",
            "title": "019. [25]M. Cremaschi, A. Rula, A. Siano, F. De Paoli, et al. Semantic table interpretation using mantistable. In OM@ISWC , pages 195–196, 2"
        },
        {
            "ref": "",
            "title": "019. [26]M. Cremaschi, B. Spahiu, M. Palmonari, and E. Jimenez-Ruiz. Survey on semantic interpretation of tabular data: Challenges and directions. arXiv preprintarXiv:2411.11891 , 2"
        },
        {
            "ref": "",
            "title": "024. [27]V. Cutrona, F. Bianchi, E. Jiménez-Ruiz, and M. Palmonari. Tough tables: Carefully evaluating entity linking for tabular data. In International Semantic Web Conference , pages 328 –"
        },
        {
            "ref": "",
            "title": "020. [28]V. Cutrona, J. Chen, V. Efthymiou, O. Hassanzadeh, E. Jimenez-Ruiz, J. Sequeda, K. Srinivas, N. Abdelmageed, M. Hulsebos, D. Oliveira, and C. Pesquita. Results of semtab 2"
        },
        {
            "ref": "",
            "title": "021. In 20thInternationalSemanticWebConference , volume 3103, pages 1 –"
        },
        {
            "ref": "",
            "title": "022. [29]V. Cutrona, M. Ciavotta, F. D. Paoli, and M. Palmonari. ASIA: a tool for assisted semantic interpretation and annotation of tabular data. InProceedings of the ISWC 2019 Satellite Tracks , volume 2456 of CEUR Workshop Proceedings , pages 209 –"
        },
        {
            "ref": "",
            "title": "019. [30]I. Dasoulas, D. Yang, X. Duan, and A. Dimou. Torchictab: Semantic table annotation with wikidata and language models. In CEUR Workshop Proceedings , pages 21 –"
        },
        {
            "ref": "",
            "title": "023. [31]X. Deng, H. Sun, A. Lees, Y. Wu, and C. Yu. Turl: Table understanding through representation learning. ACM SIGMOD Record , 51(1):33–40, 2"
        },
        {
            "ref": "",
            "title": "022. [32]J. Devlin, M.-W. Chang, K. Lee, and K. Toutanova. Bert: Pre-training of deep bidirectional transformers for language understanding. arXiv preprint arXiv:1810.04805 , 2"
        },
        {
            "ref": "",
            "title": "018. [33]V. Efthymiou, O. Hassanzadeh, M. Rodriguez-Muro, and V. Christophides. Matching web tables with knowledge base entities: From entity lookups to entity embeddings. In The Semantic Web – ISWC 2017 , pages 260–277, 2"
        },
        {
            "ref": "",
            "title": "017. [34]B. Ell, S. Hakimov, P. Braukmann, L. Cazzoli, F. Kaupmann, A. Mancino, J. Altaf Memon, K. Rother, A. Saini, and P. Cimiano. Towards a large corpus of richly annotated web tables for knowledge base population. In 5th International Workshop on Linked Data for Information Extraction , pages 2–13, 2"
        },
        {
            "ref": "",
            "title": "017. [35]Y.Eslahi,A.Bhardwaj,P.Rosso,K.Stockinger,andP.Cudré-Mauroux. Annotatingwebtablesthroughknowledgebases:Acontext-based approach. In 2020 7th Swiss Conference on Data Science (SDS) , pages 29–34, 2"
        },
        {
            "ref": "",
            "title": "020. [36]O. Hassanzadeh, N. Abdelmageed, M. Cremaschi, V. Cutrona, F. D’Adda, V. Efthymiou, B. Kruit, E. Lobo, N. Mihindukulasooriya, and N. H. Pham. Results of semtab 2"
        },
        {
            "ref": "",
            "title": "024. In CEUR Workshop Proceedings , volume 3889, pages 1–11, 2"
        },
        {
            "ref": "",
            "title": "024. [37]O. Hassanzadeh, N. Abdelmageed, V. Efthymiou, J. Chen, V. Cutrona, M. Hulsebos, E. Jiménez-Ruiz, A. Khatiwada, K. Korini, B. Kruit, et al. Results of semtab 2"
        },
        {
            "ref": "",
            "title": "023. In CEUR WorkshopProceedings , volume 3557, pages 1–14, 2"
        },
        {
            "ref": "",
            "title": "023. [38]S. Hegselmann, A. Buendia, H. Lang, M. Agrawal, X. Jiang, and D. Sontag. Tabllm: Few-shot classification of tabular data with large language models. In International Conference on Artificial Intelligence and Statistics , pages 5549–5"
        },
        {
            "ref": "",
            "title": "023. [39]E. J. Hu, Y. Shen, P. Wallis, Z. Allen-Zhu, Y. Li, S. Wang, L. Wang, and W. Chen. Lora: Low-rank adaptation of large language models. arXiv preprint arXiv:2106.09685 , 2"
        },
        {
            "ref": "",
            "title": "021. [40]V.-P. Huynh, Y. Chabot, T. Labbé, J. Liu, and R. Troncy. From heuristics to language models: A journey through the universe of semantic table interpretation with dagobah. Semantic Web Challenge on Tabular Data to Knowledge Graph Matching (SemTab) , 2"
        },
        {
            "ref": "",
            "title": "022. [41]V.-P. Huynh, Y. Chabot, and R. Troncy. Towards generative semantic table interpretation. In VLDB Workshops , 2"
        },
        {
            "ref": "",
            "title": "023. [42]V.-P. Huynh, J. Liu, Y. Chabot, F. Deuzé, T. Labbé, P. Monnin, and R. Troncy. Dagobah: Table and graph contexts for efficient semantic annotation of tabular data. SemTab@ISWC , 2"
        },
        {
            "ref": "",
            "title": "021. [43]V.-P. Huynh, J. Liu, Y. Chabot, T. Labbé, P. Monnin, and R. Troncy. Dagobah: Enhanced scoring algorithms for scalable annotations of tabular data. In SemTab@ ISWC , pages 27–39, 2"
        },
        {
            "ref": "",
            "title": "020. [44]R. A. Jacobs, M. I. Jordan, S. J. Nowlan, and G. E. Hinton. Adaptive mixtures of local experts. Neural Computation , 3(1):79–87, 1"
        },
        {
            "ref": "",
            "title": "991. [45]Z. Ji, N. Lee, R. Frieske, T. Yu, D. Su, Y. Xu, E. Ishii, Y. J. Bang, A. Madotto, and P. Fung. Survey of hallucination in natural language generation. ACM Comput. Surv. , 55(12), mar 2"
        },
        {
            "ref": "",
            "title": "023. [46]A. Q. Jiang, A. Sablayrolles, A. Roux, A. Mensch, B. Savary, C. Bamford, D. S. Chaplot, D. d. l. Casas, E. B. Hanna, F. Bressand, et al. Mixtral of experts. arXiv preprint arXiv:2401.04088 , 2"
        },
        {
            "ref": "",
            "title": "024. [47]J. Jiang, K. Zhou, W. X. Zhao, and J.-R. Wen. Unikgqa: Unified retrieval and reasoning for solving multi-hop question answering over knowledge graph, 2"
        },
        {
            "ref": "",
            "title": "023. ACM Trans. Intell. Syst. Technol. stEELlm: An LLM for Generating Semantic Annotations of TabularData • 29 [48]X. Jiao, Y. Yin, L. Shang, X. Jiang, X. Chen, L. Li, F. Wang, and Q. Liu. TinyBERT: Distilling BERT for natural language understanding. In T. Cohn, Y. He, and Y. Liu, editors, Findings of the Association for Computational Linguistics: EMNLP 2020 , pages 4163–4174, Online, Nov. 2"
        },
        {
            "ref": "2019_nguyen_mtab",
            "title": "020. Association for Computational Linguistics. [49]E. Jiménez-Ruiz, O. Hassanzadeh, V. Efthymiou, J. Chen, and K. Srinivas. Semtab 2019: Resources to benchmark tabular data to knowledge graph matching systems. In The Semantic Web , pages 514–530, Cham, 2"
        },
        {
            "ref": "2019_nguyen_mtab",
            "title": "020. Springer International Publishing. [50]E. Jiménez-Ruiz, O. Hassanzadeh, V. Efthymiou, J. Chen, and K. Srinivas. Semtab 2019: Resources to benchmark tabular data to knowledge graph matching systems. In TheSemanticWeb:17thInternationalConference,ESWC2020,Heraklion,Crete,Greece,May 31–June 4, 2020, Proceedings 17 , pages 514 –"
        },
        {
            "ref": "",
            "title": "020. [51]E. Jimenez-Ruiz, O. Hassanzadeh, V. Efthymiou, J. Chen, K. Srinivas, and V. Cutrona. Results of semtab 2"
        },
        {
            "ref": "",
            "title": "020. CEUR Workshop Proceedings , 2775:1–8, January 2"
        },
        {
            "ref": "",
            "title": "020. [52]E. Jiménez-Ruiz, O. Hassanzadeh, V. Efthymiou, J. Chen, K. Srinivas, and V. Cutrona. Results of semtab 2"
        },
        {
            "ref": "",
            "title": "020. In CEUR Workshop Proceedings , volume 2775, pages 1–8, 2"
        },
        {
            "ref": "",
            "title": "020. [53]P. Ke, H. Ji, Y. Ran, X. Cui, L. Wang, L. Song, X. Zhu, and M. Huang. Jointgt: Graph-text joint representation learning for text generation from knowledge graphs, 2"
        },
        {
            "ref": "",
            "title": "021. [54]M. Kejriwal, C. A. Knoblock, and P. Szekely. Knowledge graphs: Fundamentals, techniques, and applications . MIT Press, 2"
        },
        {
            "ref": "",
            "title": "021. [55]D. Kim, H. Park, J. K. Lee, W. Kim, E. Jiménez-Ruiz, O. Hassanzadeh, V. Efthymiou, J. Chen, and K. Srinivas. Generating conceptual subgraph from tabular data for knowledge graph matching. In SemTab@ ISWC , pages 96–103, 2"
        },
        {
            "ref": "",
            "title": "020. [56]K. Korini and C. Bizer. Column type annotation using chatgpt. arXiv preprint arXiv:2306.00745 , 2"
        },
        {
            "ref": "",
            "title": "023. [57]B. Kruit, P. Boncz, and J. Urbani. Extracting novel facts from tables for knowledge graph completion. In TheSemanticWeb–ISWC2019 , pages 364–381, Cham, 2"
        },
        {
            "ref": "",
            "title": "019. Springer International Publishing. [58]P. Li, Y. He, D. Yashar, W. Cui, S. Ge, H. Zhang, D. R. Fainman, D. Zhang, and S. Chaudhuri. Table-gpt: Table-tuned gpt for diverse table tasks, 2"
        },
        {
            "ref": "",
            "title": "023. [59]X. Li, S. Wang, W. Zhou, G. Zhang, C. Jiang, T. Hong, and P. Wang. Kgcode-tab results for semtab 2"
        },
        {
            "ref": "",
            "title": "022. [60]Y. Li, J. Li, Y. Suhara, A. Doan, and W.-C. Tan. Deep entity matching with pre-trained language models. VLDB, 2"
        },
        {
            "ref": "",
            "title": "020. [61]G. Limaye, S. Sarawagi, and S. Chakrabarti. Annotating and searching web tables using entities, types and relationships. Proc. VLDB Endow., 3(1-2):1338–1347, Sept. 2"
        },
        {
            "ref": "",
            "title": "010. [62]J. Liu, V.-P. Huynh, Y. Chabot, and R. Troncy. Radar station: Using kg embeddings for semantic table interpretation and entity disambiguation. In ISWC 2022, October 23–27, 2022 , pages 498 –"
        },
        {
            "ref": "",
            "title": "022. [63]T. Liu, F. Wang, and M. Chen. Rethinking tabular data understanding with large language models. arXivpreprintarXiv:2312.16702 , 2"
        },
        {
            "ref": "",
            "title": "023. [64]S. Mangrulkar, S. Gugger, L. Debut, Y. Belkada, S. Paul, and B. Bossan. Peft: State-of-the-art parameter-efficient fine-tuning methods. URL: https://github. com/huggingface/peft , 2"
        },
        {
            "ref": "",
            "title": "022. [65]M. Marzocchi, M. Cremaschi, R. Pozzi, R. Avogadro, and M. Palmonari. Mammotab: a giant and comprehensive dataset for semantic table interpretation. Proceedings of the SemTab2022 , 2"
        },
        {
            "ref": "",
            "title": "022. [66]I. Melnyk, P. Dognin, and P. Das. Grapher: Multi-stage knowledge graph construction using pretrained language models. In NeurIPS 2021 Workshop on Deep Generative Models and Downstream Applications , 2"
        },
        {
            "ref": "",
            "title": "021. [67]H. Morikawa. Semantic table interpretation using lod4all. SemTab@ ISWC , 2019:49–56, 2"
        },
        {
            "ref": "",
            "title": "019. [68]V. Mulwad, T. Finin, and A. Joshi. Semantic message passing for generating linked data from tables. In The Semantic Web – ISWC 2013 , pages 363 –"
        },
        {
            "ref": "",
            "title": "013. [69]V. Mulwad, T. Finin, Z. Syed, and A. Joshi. T2ld: Interpreting and representing tables as linked data. In ISWC Posters & Demonstrations Track, ISWC-PD’10, pages 25–28, Aachen, Germany, Germany, 2"
        },
        {
            "ref": "",
            "title": "010. CEUR-WS.org. [70]V. Mulwad, T. W. Finin, and A. Joshi. Automatically generating government linked data from tables. In AAAI 2011 , 2"
        },
        {
            "ref": "",
            "title": "011. [71]S. Neumaier, J. Umbrich, J. X. Parreira, and A. Polleres. Multi-level semantic labelling of numerical values. In TheSemanticWeb–ISWC 2016, pages 428–445, Cham, 2"
        },
        {
            "ref": "",
            "title": "016. Springer International Publishing. [72]P. Nguyen, N. Kertkeidkachorn, R. Ichise, and H. Takeda. Mtab: Matching tabular data to knowledge graph using probability models. arXiv preprint arXiv:1910.00246 , 2"
        },
        {
            "ref": "2020_nguyen_mtab4wikidata",
            "title": "019. [73]P. Nguyen, I. Yamada, N. Kertkeidkachorn, R. Ichise, and H. Takeda. Mtab4wikidata at semtab 2020: Tabular data annotation with wikidata. SemTab@ ISWC , 2775:86–95, 2"
        },
        {
            "ref": "2021_nguyen_semtab",
            "title": "020. [74]P. Nguyen, I. Yamada, N. Kertkeidkachorn, R. Ichise, and H. Takeda. Semtab 2021: Tabular data annotation with mtab tool. In SemTab@ ISWC, pages 92–101, 2"
        },
        {
            "ref": "",
            "title": "021. [75]D. Oliveira and M. d’Aquin. Adog-annotating data with ontologies and graphs. SemTab@ ISWC , 2019:1–6, 2"
        },
        {
            "ref": "",
            "title": "019. [76]OpenAI. Gpt-4 technical report, 2"
        },
        {
            "ref": "",
            "title": "023. [77]L. Ouyang, J. Wu, X. Jiang, D. Almeida, C. Wainwright, P. Mishkin, C. Zhang, S. Agarwal, K. Slama, A. Ray, J. Schulman, J. Hilton, F. Kelton, L. Miller, M. Simens, A. Askell, P. Welinder, P. F. Christiano, J. Leike, and R. Lowe. Training language models to follow ACM Trans. Intell. Syst. Technol. 30 • Cremaschi, et al. instructions with human feedback. In S. Koyejo, S. Mohamed, A. Agarwal, D. Belgrave, K. Cho, and A. Oh, editors, Advances in Neural Information Processing Systems , volume 35, pages 27730–27"
        },
        {
            "ref": "",
            "title": "022. [78]M. Palmonari, M. Ciavotta, F. De Paoli, A. Košmerlj, and N. Nikolov. Ew-shopp project: Supporting event and weather-based data analytics and marketing along the shopper journey. In Advances in Service-Oriented and Cloud Computing , pages 187–191, Cham, 2"
        },
        {
            "ref": "",
            "title": "020. Springer International Publishing. [79]F. Pan, M. Canim, M. Glass, A. Gliozzo, and J. Hendler. End-to-end table question answering via retrieval-augmented generation. arXiv preprint arXiv:2203.16714 , 2"
        },
        {
            "ref": "",
            "title": "022. [80]S. Pan, L. Luo, Y. Wang, C. Chen, J. Wang, and X. Wu. Unifying large language models and knowledge graphs: A roadmap. IEEE Transactionson Knowledge and Data Engineering , pages 1–20, 2"
        },
        {
            "ref": "",
            "title": "024. [81]S. Pan, L. Luo, Y. Wang, C. Chen, J. Wang, and X. Wu. Unifying large language models and knowledge graphs: A roadmap. IEEE Transactionson Knowledge and Data Engineering , page 1–20, 2"
        },
        {
            "ref": "",
            "title": "024. [82]R. Peeters and C. Bizer. Using chatgpt for entity matching. arXiv preprint arXiv:2305.03423 , 2"
        },
        {
            "ref": "",
            "title": "023. [83]F. Petroni, T. Rocktäschel, P. Lewis, A. Bakhtin, Y. Wu, A. H. Miller, and S. Riedel. Language models as knowledge bases? [84]R. Rafailov, A. Sharma, E. Mitchell, S. Ermon, C. D. Manning, and C. Finn. Direct preference optimization: Your language model is secretly a reward model. arXiv preprint arXiv:2305.18290 , 2"
        },
        {
            "ref": "",
            "title": "023. [85]D. Rao, P. McNamee, and M. Dredze. Entity linking: Finding extracted entities in a knowledge base. In Multi-source, Multilingual Information Extraction and Summarization , pages 93–115, Berlin, Heidelberg, 2"
        },
        {
            "ref": "",
            "title": "013. Springer Berlin Heidelberg. [86]L.RatinovandD.Roth. Designchallengesandmisconceptionsinnamedentityrecognition. In ProceedingsoftheThirteenthConferenceon Computational Natural Language Learning (CoNLL-2"
        },
        {
            "ref": "",
            "title": "009) , pages 147–155, Boulder, Colorado, June 2"
        },
        {
            "ref": "",
            "title": "009. Association for Computational Linguistics. [87]D. Ritze, O. Lehmberg, and C. Bizer. Matching html tables to dbpedia. In 5th International Conference on Web Intelligence, Mining and Semantics , WIMS ’15, pages 10:1–10:6, New York, NY, USA, 2"
        },
        {
            "ref": "",
            "title": "015. ACM. [88]D. Schicchi, A. Upadhyaya, M. Fisichella, and D. Taibi. Using chatgpt to enhance students’ behavior in social media via the moral foundation theory. In Proceedingsofthe FirstInternational WorkshoponHigh-performance ArtificialIntelligenceSystems inEducation co-located with 22nd International Conference of the Italian Association for Artificial Intelligence (AIxIA 2"
        },
        {
            "ref": "",
            "title": "023) , volume 3605 of CEUR Workshop Proceedings , 2"
        },
        {
            "ref": "",
            "title": "023. [89]R. Shigapov, P. Zumstein, J. Kamlah, L. Oberländer, J. Mechnich, and I. Schumm. bbw: Matching csv to wikidata via meta-lookup. In CEUR Workshop Proceedings , volume 2775, pages 17 –"
        },
        {
            "ref": "",
            "title": "020. [90]A. Shigarov. Table understanding: Problem overview. WIREs Data Mining and Knowledge Discovery , 13(1):e1482, 2"
        },
        {
            "ref": "",
            "title": "023. [91]B. Steenwinckel, F. De Turck, and F. Ongenae. Magic: Mining an augmented graph using ink, starting from a csv. In SemTab@ ISWC , pages 68–78, 2"
        },
        {
            "ref": "",
            "title": "021. [92]B. Steenwinckel, G. Vandewiele, F. De Turck, and F. Ongenae. Csv2kg: Transforming tabular data into semantic knowledge. SemTab, ISWC Challenge , 2"
        },
        {
            "ref": "",
            "title": "019. [93]Y. Suhara, J. Li, Y. Li, D. Zhang, Ç. Demiralp, C. Chen, and W.-C. Tan. Annotating columns with pre-trained language models. In Proceedings of the 2022 International Conference on Management of Data , pages 1493–1503, 2"
        },
        {
            "ref": "",
            "title": "022. [94]Z. Syed, T. Finin, V. Mulwad, and A. Joshi. Exploiting a web of semantic data for interpreting tables. In Proceedings of the Second Web Science Conference , volume 5, 2"
        },
        {
            "ref": "",
            "title": "010. [95]A. Thawani, M. Hu, E. Hu, H. Zafar, N. T. Divvala, A. Singh, E. Qasemi, P. A. Szekely, and J. Pujara. Entity linking to knowledge graphs to infer column types and properties. SemTab@ ISWC , 2019:25–32, 2"
        },
        {
            "ref": "",
            "title": "019. [96]H. Tian, C. Gao, X. Xiao, H. Liu, B. He, H. Wu, H. Wang, and F. Wu. Skep: Sentiment knowledge enhanced pre-training for sentiment analysis. arXiv preprint arXiv:2005.05635 , 2"
        },
        {
            "ref": "",
            "title": "020. [97]H. Touvron, T. Lavril, G. Izacard, X. Martinet, M.-A. Lachaux, T. Lacroix, B. Rozière, N. Goyal, E. Hambro, F. Azhar, A. Rodriguez, A. Joulin, E. Grave, and G. Lample. Llama: Open and efficient foundation language models, 2"
        },
        {
            "ref": "",
            "title": "023. [98]H. Touvron, L. Martin, K. Stone, P. Albert, A. Almahairi, Y. Babaei, N. Bashlykov, S. Batra, P. Bhargava, S. Bhosale, D. Bikel, L. Blecher, C. C. Ferrer, M. Chen, G. Cucurull, D. Esiobu, J. Fernandes, J. Fu, W. Fu, B. Fuller, C. Gao, V. Goswami, N. Goyal, A. Hartshorn, S. Hosseini, R. Hou, H. Inan, M. Kardas, V. Kerkez, M. Khabsa, I. Kloumann, A. Korenev, P. S. Koura, M.-A. Lachaux, T. Lavril, J. Lee, D. Liskovich, Y. Lu, Y. Mao, X. Martinet, T. Mihaylov, P. Mishra, I. Molybog, Y. Nie, A. Poulton, J. Reizenstein, R. Rungta, K. Saladi, A. Schelten, R. Silva, E. M. Smith, R. Subramanian, X. E. Tan, B. Tang, R. Taylor, A. Williams, J. X. Kuan, P. Xu, Z. Yan, I. Zarov, Y. Zhang, A. Fan, M. Kambadur, S. Narang, A. Rodriguez, R. Stojnic, S. Edunov, and T. Scialom. Llama 2: Open foundation and fine-tuned chat models, 2"
        },
        {
            "ref": "",
            "title": "023. [99]S. Tyagi and E. Jimenez-Ruiz. Lexma: Tabular data to knowledge graph matching using lexical techniques. In CEUR Workshop Proceedings , volume 2775, pages 59–64, 2"
        },
        {
            "ref": "",
            "title": "020. [100]J. Wang, H. Wang, Z. Wang, and K. Q. Zhu. Understanding tables on the web. In Proceedingsofthe31stInternationalConferenceon Conceptual Modeling , ER’12, pages 141 –"
        },
        {
            "ref": "",
            "title": "012. ACM Trans. Intell. Syst. Technol. stEELlm: An LLM for Generating Semantic Annotations of TabularData • 31 [101]X. Wang, T. Gao, Z. Zhu, Z. Zhang, Z. Liu, J. Li, and J. Tang. KEPLER: A Unified Model for Knowledge Embedding and Pre-trained Language Representation. Transactions of the Association for Computational Linguistics , 9:176–194, 03 2"
        },
        {
            "ref": "",
            "title": "021. [102]J. Wei, X. Wang, D. Schuurmans, M. Bosma, b. ichter, F. Xia, E. Chi, Q. V. Le, and D. Zhou. Chain-of-thought prompting elicits reasoning inlargelanguagemodels. InS.Koyejo,S.Mohamed,A.Agarwal,D.Belgrave,K.Cho,andA.Oh,editors, AdvancesinNeuralInformation Processing Systems , volume 35, pages 24824–24"
        },
        {
            "ref": "",
            "title": "022. [103]G. Weikum, X. L. Dong, S. Razniewski, and F. M. Suchanek. Machine knowledge: Creation and curation of comprehensive knowledge bases.Found. Trends Databases , 10(2-4):108–490, 2"
        },
        {
            "ref": "",
            "title": "021. [104]L. Wu, F. Petroni, M. Josifoski, S. Riedel, and L. Zettlemoyer. Scalable zero-shot entity linking with dense entity retrieval. In B. Webber, T. Cohn, Y. He, and Y. Liu, editors, Proceedingsofthe2020Conferenceon EmpiricalMethodsinNaturalLanguage Processing (EMNLP) , pages 6397–6407, Online, Nov. 2"
        },
        {
            "ref": "",
            "title": "020. Association for Computational Linguistics. [105]L. Yang, H. Chen, Z. Li, X. Ding, and X. Wu. Give us the facts: Enhancing large language models with knowledge graphs for fact-aware language modeling. IEEE Transactions on Knowledge and Data Engineering , 36(07):3091–3110, jul 2"
        },
        {
            "ref": "",
            "title": "024. [106]L. Yang, S. Shen, J. Ding, and J. Jin. Gbmtab: A graph-based method for interpreting noisy semantic table to knowledge graph. In SemTab@ ISWC , pages 32–41, 2"
        },
        {
            "ref": "",
            "title": "021. [107]L. Yao, C. Mao, and Y. Luo. Kg-bert: Bert for knowledge graph completion, 2"
        },
        {
            "ref": "",
            "title": "019. [108]L. Yao, C. Mao, and Y. Luo. Kg-bert: Bert for knowledge graph completion. arXiv preprint arXiv:1909.03193 , 2"
        },
        {
            "ref": "",
            "title": "019. [109]H. Zhang, H. Song, S. Li, M. Zhou, and D. Song. A survey of controllable text generation using transformer-based pre-trained language models.ACMComput. Surv. , 56(3), oct 2"
        },
        {
            "ref": "",
            "title": "023. [110]M. Zhang and K. Chakrabarti. Infogather+: semantic matching and annotation of numeric and time-varying attributes in web tables. InProceedings of the 2013 ACM SIGMOD International Conference on Management of Data , SIGMOD ’13, page 145–156, New York, NY, USA, 2"
        },
        {
            "ref": "",
            "title": "013. Association for Computing Machinery. [111]S. Zhang and K. Balog. Ad hoc table retrieval using semantic similarity. In International World Wide Web Conference , WWW ’18, page 1553–1562, Republic and Canton of Geneva, CHE, 2"
        },
        {
            "ref": "",
            "title": "018. [112]S. Zhang, E. Meij, K. Balog, and R. Reinanda. Novel entity discovery from web tables. In Proceedings of The Web Conference 2020 , WWW ’20, page 1298–1308, New York, NY, USA, 2"
        },
        {
            "ref": "",
            "title": "020. Association for Computing Machinery. [113]Z. Zhang. Effective and efficient semantic table interpretation using tableminer+. Semantic Web , 8(6):921–957, 2"
        },
        {
            "ref": "",
            "title": "017. [114]Z. Zhang, X. Han, Z. Liu, X. Jiang, M. Sun, and Q. Liu. Ernie: Enhanced language representation with informative entities. arXiv preprint arXiv:1905.07129 , 2"
        },
        {
            "ref": "",
            "title": "019. [115]L. Zheng, W.-L. Chiang, Y. Sheng, S. Zhuang, Z. Wu, Y. Zhuang, Z. Lin, Z. Li, D. Li, E. Xing, et al. Judging llm-as-a-judge with mt-bench and chatbot arena. arXiv preprint arXiv:2306.05685 , 2"
        },
        {
            "ref": "",
            "title": "023. Received 17 February 2024; revised 10 December 2024; accepted 1 February 2025 ACM Trans. Intell. Syst. Technol."
        }
    ]
}